In [1]:
import pandas as pd
import numpy as np

In [3]:
data = pd.Series([0.25,0.5,0.75, 1.0], 
                 index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [9]:
print(type(data.index), type(data.keys())) #Снова можно по-разному

<class 'pandas.core.indexes.base.Index'> <class 'pandas.core.indexes.base.Index'>

In [20]:
print(data[0:3],'\n', data['a':'c'])

a    0.25
b    0.50
c    0.75
dtype: float64
 a    0.25
b    0.50
c    0.75
dtype: float64

In [22]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [45]:
data = pd.Series(['a','b', 'c'], index = [1,3,5])
data[:4]

1    a
3    b
5    c
dtype: object

In [64]:
#Явное обозначение индексов explicit better than implisit
print('data.loc[1]\n', data.loc[1], '\ndata.loc[1:3]\n', data.loc[1:3], sep="")

data.loc[1]
a
data.loc[1:3]
1    a
3    b
dtype: object

In [65]:
#не явное, то есть как по порядку и дет так и есть implicit

print('data.iloc[1]\n', data.iloc[1], '\ndata.iloc[1:3]\n', data.iloc[1:3], sep="")

data.iloc[1]
b
data.iloc[1:3]
3    b
5    c
dtype: object

In [69]:
 
area = pd.Series({'California': 4967, 'Texas': 2325, 'New York': 839284,
            'Florida': 32093, 'Illinois':3002})
pop = pd.Series({'California': 5443144, 'Texas': 1343414, 'New York': 1234213424,
            'Florida': 1234243, 'Illinois':1234214})
data = pd.DataFrame({'area': area, 'pop': pop})
data

              area         pop
California    4967     5443144
Texas         2325     1343414
New York    839284  1234213424
Florida      32093     1234243
Illinois      3002     1234214

In [71]:
data['area'] is data.area

True

In [79]:
data['density'] = data['pop'] / data['area']
data

              area         pop      density
California    4967     5443144  1095.861486
Texas         2325     1343414   577.812473
New York    839284  1234213424  1470.555168
Florida      32093     1234243    38.458324
Illinois      3002     1234214   411.130580

In [84]:
data.values

(5, 3)

In [86]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.967000e+03  2.325000e+03  8.392840e+05  3.209300e+04  3.002000e+03
pop      5.443144e+06  1.343414e+06  1.234213e+09  1.234243e+06  1.234214e+06
density  1.095861e+03  5.778125e+02  1.470555e+03  3.845832e+01  4.111306e+02

In [97]:
data.iloc[:3, :2]

              area         pop
California    4967     5443144
Texas         2325     1343414
New York    839284  1234213424

In [99]:
data.loc[:'New York', :'pop']

              area         pop
California    4967     5443144
Texas         2325     1343414
New York    839284  1234213424

In [103]:
data.loc[data.density<100, ['pop', 'density']]

             pop    density
Florida  1234243  38.458324

(5,)